## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.acr.azurerm_redis_cache.redis_prod will be updated in-place
  ~ resource "azurerm_redis_cache" "redis_prod" {
      ~ enable_non_ssl_port           = true -> false
        id                            = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Cache/redis/fp11redisprod"
        name                          = "fp11redisprod"
        tags                          = {}
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acr.azurerm_redis_cache.redis_test will be updated in-place
  ~ resource "azurerm_redis_cache" "redis_test" {
      ~ enable_non_ssl_port           = true -> false
        id                            = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Cache/redis/fp11redistest"
        name                          = "fp11redistest"
        tags                          = {}
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acr.azurerm_role_assignment.aks_prod_acr_pull will be created
  + resource "azurerm_role_assignment" "aks_prod_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "00da081d-9cb7-4410-902f-c5e2fdab3c46"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.ContainerRegistry/registries/fp11weatheracr"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acr.azurerm_role_assignment.aks_test_acr_pull will be created
  + resource "azurerm_role_assignment" "aks_test_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b560e17b-9541-424c-8c6e-3ab1fb3f953d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.ContainerRegistry/registries/fp11weatheracr"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.prod will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "prod" {
        id                                  = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.ContainerService/managedClusters/fp11-aks-prod"
        name                                = "fp11-aks-prod"
        tags                                = {
            "environment" = "prod"
        }
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.test will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "test" {
        id                                  = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.ContainerService/managedClusters/fp11-aks-test"
        name                                = "fp11-aks-test"
        tags                                = {
            "environment" = "test"
        }
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.
```
</details>